reports/033-reason.txt
Running 1m test @ http://localhost:8080
  3 threads and 33 connections
  Thread calibration: mean lat.: 1.506ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.512ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.513ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.49ms  745.45us  10.94ms   69.22%
    Req/Sec     3.51k   281.22     6.11k    73.27%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.39ms
 75.000%    1.93ms
 90.000%    2.47ms
 99.000%    3.67ms
 99.900%    4.42ms
 99.990%    9.02ms
 99.999%   10.17ms
100.000%   10.94ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.094     0.000000            1         1.00
       0.621     0.100000        50086         1.11
       0.830     0.200000       100118         1.25
       1.008     0.300000       149853         1.43
       1.188     0.400000       199993         1.67
       1.388     0.500000       249815         2.00
       1.491     0.550000       274783         2.22
       1.593     0.600000       299744         2.50
       1.698     0.650000       324784         2.86
       1.810     0.700000       349662         3.33
       1.932     0.750000       374720         4.00
       1.998     0.775000       387201         4.44
       2.071     0.800000       399518         5.00
       2.153     0.825000       412090         5.71
       2.247     0.850000       424714         6.67
       2.349     0.875000       437059         8.00
       2.407     0.887500       443304         8.89
       2.471     0.900000       449638        10.00
       2.541     0.912500       455822        11.43
       2.619     0.925000       461989        13.33
       2.711     0.937500       468243        16.00
       2.763     0.943750       471375        17.78
       2.821     0.950000       474481        20.00
       2.885     0.956250       477555        22.86
       2.967     0.962500       480704        26.67
       3.065     0.968750       483823        32.00
       3.129     0.971875       485353        35.56
       3.203     0.975000       486934        40.00
       3.277     0.978125       488476        45.71
       3.363     0.981250       490037        53.33
       3.457     0.984375       491595        64.00
       3.513     0.985938       492380        71.11
       3.569     0.987500       493155        80.00
       3.629     0.989062       493927        91.43
       3.703     0.990625       494724       106.67
       3.785     0.992188       495506       128.00
       3.821     0.992969       495880       142.22
       3.869     0.993750       496272       160.00
       3.923     0.994531       496666       182.86
       3.983     0.995313       497055       213.33
       4.043     0.996094       497451       256.00
       4.077     0.996484       497635       284.44
       4.111     0.996875       497843       320.00
       4.147     0.997266       498033       365.71
       4.187     0.997656       498234       426.67
       4.235     0.998047       498421       512.00
       4.267     0.998242       498515       568.89
       4.299     0.998437       498620       640.00
       4.327     0.998633       498715       731.43
       4.383     0.998828       498812       853.33
       4.427     0.999023       498907      1024.00
       4.459     0.999121       498957      1137.78
       4.479     0.999219       498999      1280.00
       4.527     0.999316       499051      1462.86
       4.591     0.999414       499101      1706.67
       4.919     0.999512       499146      2048.00
       5.395     0.999561       499171      2275.56
       5.663     0.999609       499194      2560.00
       6.303     0.999658       499219      2925.71
       6.735     0.999707       499243      3413.33
       7.291     0.999756       499268      4096.00
       7.691     0.999780       499280      4551.11
       7.951     0.999805       499292      5120.00
       8.083     0.999829       499304      5851.43
       8.255     0.999854       499316      6826.67
       8.599     0.999878       499330      8192.00
       8.887     0.999890       499335      9102.22
       9.031     0.999902       499342     10240.00
       9.215     0.999915       499347     11702.86
       9.311     0.999927       499353     13653.33
       9.351     0.999939       499360     16384.00
       9.367     0.999945       499363     18204.44
       9.391     0.999951       499365     20480.00
       9.615     0.999957       499368     23405.71
       9.679     0.999963       499372     27306.67
       9.703     0.999969       499375     32768.00
       9.823     0.999973       499376     36408.89
       9.871     0.999976       499377     40960.00
      10.023     0.999979       499379     46811.43
      10.039     0.999982       499380     54613.33
      10.159     0.999985       499382     65536.00
      10.167     0.999986       499384     72817.78
      10.167     0.999988       499384     81920.00
      10.167     0.999989       499384     93622.86
      10.231     0.999991       499385    109226.67
      10.295     0.999992       499386    131072.00
      10.295     0.999993       499386    145635.56
      10.295     0.999994       499386    163840.00
      10.519     0.999995       499387    187245.71
      10.519     0.999995       499387    218453.33
      10.679     0.999996       499388    262144.00
      10.679     0.999997       499388    291271.11
      10.679     0.999997       499388    327680.00
      10.679     0.999997       499388    374491.43
      10.679     0.999998       499388    436906.67
      10.943     0.999998       499389    524288.00
      10.943     1.000000       499389          inf
#[Mean    =        1.487, StdDeviation   =        0.745]
#[Max     =       10.936, Total count    =       499389]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599688 requests in 1.00m, 22.88MB read
Requests/sec:   9994.79
Transfer/sec:    390.42KB