reports/033-swift-zewo.txt
Running 1m test @ http://localhost:8080
  3 threads and 33 connections
  Thread calibration: mean lat.: 1.390ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.428ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.410ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.43ms  691.74us  11.74ms   71.19%
    Req/Sec     3.51k   275.18     5.70k    71.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.38ms
 75.000%    1.84ms
 90.000%    2.26ms
 99.000%    3.04ms
 99.900%    8.10ms
 99.990%   10.56ms
 99.999%   11.37ms
100.000%   11.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.090     0.000000            2         1.00
       0.619     0.100000        50081         1.11
       0.839     0.200000        99912         1.25
       1.028     0.300000       149859         1.43
       1.205     0.400000       199981         1.67
       1.378     0.500000       249793         2.00
       1.464     0.550000       274912         2.22
       1.552     0.600000       299835         2.50
       1.643     0.650000       324813         2.86
       1.737     0.700000       349767         3.33
       1.838     0.750000       374560         4.00
       1.894     0.775000       387090         4.44
       1.953     0.800000       399586         5.00
       2.016     0.825000       412113         5.71
       2.087     0.850000       424748         6.67
       2.165     0.875000       437156         8.00
       2.207     0.887500       443241         8.89
       2.255     0.900000       449647        10.00
       2.305     0.912500       455770        11.43
       2.361     0.925000       461975        13.33
       2.427     0.937500       468271        16.00
       2.463     0.943750       471321        17.78
       2.505     0.950000       474493        20.00
       2.549     0.956250       477612        22.86
       2.599     0.962500       480761        26.67
       2.659     0.968750       483831        32.00
       2.693     0.971875       485423        35.56
       2.733     0.975000       486941        40.00
       2.777     0.978125       488553        45.71
       2.827     0.981250       490059        53.33
       2.887     0.984375       491633        64.00
       2.919     0.985938       492380        71.11
       2.959     0.987500       493190        80.00
       3.003     0.989062       493955        91.43
       3.059     0.990625       494747       106.67
       3.127     0.992188       495521       128.00
       3.165     0.992969       495895       142.22
       3.213     0.993750       496289       160.00
       3.273     0.994531       496680       182.86
       3.347     0.995313       497070       213.33
       3.457     0.996094       497456       256.00
       3.523     0.996484       497649       284.44
       3.629     0.996875       497845       320.00
       3.753     0.997266       498039       365.71
       3.939     0.997656       498232       426.67
       4.491     0.998047       498428       512.00
       5.063     0.998242       498525       568.89
       5.919     0.998437       498622       640.00
       6.747     0.998633       498720       731.43
       7.483     0.998828       498817       853.33
       8.171     0.999023       498915      1024.00
       8.455     0.999121       498966      1137.78
       8.695     0.999219       499013      1280.00
       8.975     0.999316       499062      1462.86
       9.239     0.999414       499111      1706.67
       9.463     0.999512       499159      2048.00
       9.599     0.999561       499183      2275.56
       9.703     0.999609       499208      2560.00
       9.791     0.999658       499232      2925.71
       9.887     0.999707       499257      3413.33
       9.983     0.999756       499281      4096.00
      10.055     0.999780       499296      4551.11
      10.103     0.999805       499305      5120.00
      10.183     0.999829       499317      5851.43
      10.271     0.999854       499329      6826.67
      10.439     0.999878       499342      8192.00
      10.495     0.999890       499348      9102.22
      10.567     0.999902       499354     10240.00
      10.631     0.999915       499360     11702.86
      10.671     0.999927       499366     13653.33
      10.743     0.999939       499372     16384.00
      10.783     0.999945       499375     18204.44
      10.839     0.999951       499378     20480.00
      10.871     0.999957       499382     23405.71
      10.903     0.999963       499384     27306.67
      10.991     0.999969       499387     32768.00
      11.095     0.999973       499389     36408.89
      11.103     0.999976       499390     40960.00
      11.127     0.999979       499392     46811.43
      11.151     0.999982       499393     54613.33
      11.215     0.999985       499395     65536.00
      11.359     0.999986       499396     72817.78
      11.359     0.999988       499396     81920.00
      11.367     0.999989       499397     93622.86
      11.527     0.999991       499398    109226.67
      11.559     0.999992       499399    131072.00
      11.559     0.999993       499399    145635.56
      11.559     0.999994       499399    163840.00
      11.623     0.999995       499400    187245.71
      11.623     0.999995       499400    218453.33
      11.671     0.999996       499401    262144.00
      11.671     0.999997       499401    291271.11
      11.671     0.999997       499401    327680.00
      11.671     0.999997       499401    374491.43
      11.671     0.999998       499401    436906.67
      11.743     0.999998       499402    524288.00
      11.743     1.000000       499402          inf
#[Mean    =        1.425, StdDeviation   =        0.692]
#[Max     =       11.736, Total count    =       499402]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599690 requests in 1.00m, 22.88MB read
Requests/sec:   9994.64
Transfer/sec:    390.42KB